Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: But only a great fear of being judged, and of the fire of wrath which will be the destruction of the haters of God.
chr: ᎤᎾᏰᎯᏍᏗᏉᏍᎩᏂ ᎣᏓᏅᏛ ᎠᎦᏖᎾᏍᏗᏱ ᏗᎫᎪᏙᏗ ᎢᎦ ᎨᏒᎢ, ᎠᎴ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎠᏥᎸ ᎾᏍᎩᏯ, ᎾᏍᎩ ᎤᏂᏛᏙᏗ ᏥᎩ ᎬᏩᏍᎦᎩ.

source: A man who has gone against the law of Moses is put to death without pity on the word of two or three witnesses:
chr: ᎩᎶ ᎼᏏ ᎤᏤᎵ ᏗᎧᎿᏩᏛᏍᏗ ᎢᏴᏛ ᎢᏳᏩᏁᏔᏅᎯ ᏥᎨᏎ ᎠᏲᎱᏍᎨ ᎦᏰᏥᏙᎵᏍᏗ ᏂᎨᏒᎾ ᎠᏂᏔᎵᎭ ᎠᏂᎦᏔᎯ ᎤᏂᏃᎮᎸᎯ ᎬᏔᏅᎯ;

source: But will not the man by whom the Son of God has been crushed under foot, and the blood of the agreement with which he was washed clean has been taken as an unholy thing, and who has had no respect for the Spirit of grace, be judged bad enough for a very much worse punishment?
chr: ᏝᏍᎪ ᎤᏟ ᎢᎦᎢ ᏱᏂᏙᎬᏩᏳᎪᏗ ᎠᏥᏍᏛᏗᏍᏙᏗᏱ ᎩᎶ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎤᎳᏍᏓᎡᎸᎯ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎩᎬᎧᏃᎮᏛ ᏗᏠᎯᏍᏙᏔᏅᎯ ᎾᏍᎩ ᎤᏓᏅᎦᎶᏔᏅᎯ ᎨᏒ ᎦᏓᎭ ᎤᏰᎸᏅᎯ, ᎠᎴ ᎦᎬᏩᏐᏢᏔᏅᎯ ᎬᏩᎦᏘᏯ ᎠᏓᏙᎵᎩ ᎠᏓᏅᏙ.

source: For we have had experience of him who says, Punishment is mine, I will give reward. And again, The Lord will be judge of his people.
chr: ᎡᏗᎦᏔᎭᏰᏃ ᎾᏍᎩ Ꮎ ᎯᎠ ᎢᏳᏪᏛ ᏥᎩ, ᎠᏞᎢᏍᏗ ᎨᏒ ᎠᏴ ᎠᏆᏤᎵᎦ, ᎠᏴ ᏓᎦᎫᏴᎯ, ᎠᏗᎭ ᏱᎰᏩ. ᎠᎴ ᏔᎵᏁᎢ, ᏱᎰᏩ ᏙᏓᎫᎪᏓᏁᎵ ᏧᏤᎵ ᏴᏫ.

source: We may well go in fear of falling into the hands of the living God.
chr: ᎤᎾᏰᎯᏍᏗᏳ ᎬᏂᏛ ᎤᏁᎳᏅᎯ ᏧᏬᏰᏂ ᏫᏗᎩᏅᎢᏍᏗᏱ.

source: But give thought to the days after you had seen the light, when you went through a great war of troubles;
chr: ᎠᏎᏃ ᎢᏣᏅᏓᏓ ᏧᏩᎫᏔᏅᏒᎢ, ᎾᏍᎩ ᎾᎯᏳ ᎢᎦ ᏂᏕᏣᏗᏍᏓᏁᎶᎢ, ᎤᏣᏘ ᎢᏣᏟᏂᎬᏁᎸ ᏕᏥᎦᏘᎸᏒ ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒᎢ;

source: In part, in being attacked by angry words and cruel acts, before the eyes of everyone, and in part, in being united with those who were attacked in this way.
chr: ᎾᏍᎩ ᎢᎸᎯᏳ ᏥᎦᏰᏥᏐᏢᏛᎢ, ᎠᎴ ᏤᏥᎩᎵᏲᎢᏍᏗᏍᎬᎢ; ᎢᎸᎯᏳᏃ ᏕᏣᎵᎪᏁᎸ ᎾᏍᎩ ᎢᎨᎬᏁᎸᎯ.

source: For you had pity on those who were in prison, and had joy in the loss of your property, in the knowledge that you still had a better property and one which you would keep for ever.
chr: ᎥᏆᎸᎢᏛᏰᏃ ᎨᏒ ᎢᏳᏍᏗ ᎥᏍᎩᏯᏙᎵᏨᎩ, ᎠᎴ ᎤᎵᎮᎵᏍᏗᏉ ᎥᏣᏓᏅᏛᎩ ᎡᏥᏬᏅᎲ ᏧᎬᏩᎶᏗ ᎢᏥᎲᎢ, ᎢᏥᎦᏔᎲᎩᏰᏃ ᎦᎸᎳᏗ ᏫᏥᏍᏆᏂᎪᏛ ᎤᏟ ᎢᏲᏍᏛ ᎠᎴ ᎠᏲᎩ ᏂᎨᏒᎾ ᏧᎬᏩᎶᏗ.

source: So do not give up your hope which will be greatly rewarded.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏞᏍᏗ ᎢᏴᏛ ᎢᏨᏁᏔᏅᎩ ᎢᏦᎯᏳᏒᎢ, ᎾᏍᎩ ᎤᏣᏘ ᎤᏓᎫᏴᎡᏗ ᏥᎩ.

source: For, having done what was right in God's eyes, you have need of waiting before his word has effect for you.
chr: ᏗᏨᏂᏗᏳ ᎢᏣᎵᏍᏙᏗᏱ ᎤᏚᎸᏗᏳ ᏂᏣᎵᏍᏓᏁᎭ; ᎾᏍᎩ ᎿᏉ ᎤᏁᎳᏅᎯ ᎤᏏᏳ ᎤᏴᎸᏗ ᎨᏒ ᎢᏣᏛᏁᎸᎯ ᎨᏎᏍᏗ, ᎢᏣᏤᎵ ᎢᎬᏩᎵᏍᏙᏗ ᏱᎩ ᏄᏍᏛ ᎠᏚᎢᏍᏛᎢ.

source: In a very little time he who is coming will come; he will not be slow.
chr: ᎿᏉᏰᏃ ᏂᎪᎯᎸᎾᏉ, ᎾᏍᎩ ᎤᎷᎯᏍᏗ ᏥᎩ ᏓᎦᎷᏥ, ᎠᎴ ᎥᏝ ᏴᏛᏙᎯᏗ.

source: But the upright man will be living by his faith; and if he goes back, my soul will have no pleasure in him.
chr: ᎤᎾᏓᏅᏘᏃ ᎪᎯᏳᏗ ᎨᏒ ᎤᎾᏛᏂᏗᏍᏕᏍᏗ; ᎩᎶᏍᎩᏂ ᎢᏳᏍᏗ ᎢᎠᏨᏍᎨᏍᏗ ᎠᏆᏓᏅᏙ ᎥᏝ ᎣᏏᏳ ᏳᏰᎸᏎᏍᏗ ᎾᏍᎩ.

source: But we are not of those who go back to destruction; but of those who have faith even to the salvation of the soul.
chr: ᎠᏎᏃ ᎥᏝ ᎠᎾᏨᏍᎩ ᏥᎩ [ᎤᎾᏓᏡᎬ] ᎢᏖᎳ ᏱᎩ, ᎾᏍᎩ ᎨᏥᏛᏙᏗ ᎨᏒ ᎢᏴᏛ ᏥᏩᏂᎷᎦ, ᎾᏍᎩᏍᎩᏂ Ꮎ ᎤᎾᏓᏡᎬ ᎢᏖᎳ, ᎾᏍᎩ ᎤᏃᎯᏳᏒ ᏥᏓᏂᏍᏕᎸᏗ ᏧᎾᏓᏅᏙ.

source: Now faith is the substance of things hoped for, and the sign that the things not seen are true.
chr: ᎪᎯᏳᏗᏃ ᎨᏒ ᎯᎠ ᏄᏍᏗ ᎦᏛᎬᎢ, ᎤᎵᏂᎩᏛ ᎪᎯᏳᏗᏱ ᎠᎪᏩᏛᏗᏱ ᎨᏒ ᏄᏍᏛ ᎤᏚᎩ ᎣᏩᏒᎢ, ᎠᎴ ᏄᏜᏏᏛᏒᎾ ᎢᏳᏓᎵᏍᏓᏁᏗᏱ ᎡᎲ ᎾᏍᎩ Ꮎ ᎠᏏ ᎠᎪᎲᎯ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: For by it our fathers had God's approval.
chr: ᎾᏍᎩᏰᏃ ᎠᏅᏗᏍᎬ ᎡᏘ ᎤᎾᏕᏅᎯ ᎣᏍᏛ ᎨᏥᏃᎮᏗᏱ ᎤᏂᏩᏛᎲᎩ.

source: By faith it is clear to us that the order of events was fixed by the word of God, so that what is seen has not been made from things which only seem to be.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎢᏛᏗᏍᎬ ᎢᏙᎵᎦ ᎤᏁᎳᏅᎯ ᎧᏁᎬ ᎬᏔᏅᎯ ᎨᏒ ᎡᎶᎯ ᏚᏙᏢᏅᎢ, ᎾᏍᎩᏃ ᏧᏓᎴᏅᏛ ᎠᎪᏩᏛᏗ ᏥᎩ ᎥᏝ ᎾᏍᎩ Ꮎ ᎬᏂᎨᏒ ᎢᏳᎵᏍᏔᏅᎯ ᎨᏒ ᏗᎪᏢᏔᏅᎯ ᏱᎩ.

source: By faith Abel made a better offering to God than Cain, and he had witness through it of his righteousness, God giving his approval of his offering: and his voice still comes to us through it though he is dead.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎡᏈᎵ ᎤᏟ ᎢᏲᏍᏛ ᎤᎵᏍᎪᎸᏓᏁᎴ ᎤᏁᎳᏅᎯ ᎠᏥᎸ-ᎨᎳᏍᏙᏗ ᎨᏒ ᎡᏍᎦᏉ ᎨᏂ, ᎾᏍᎩ ᏄᏛᏁᎸ ᎤᏩᏛᏔᏁ ᎪᎯᏳᏗᏍᎩ ᎤᏓᎤᏗᏳ ᎨᏒᎢ, ᎤᏁᎳᏅᎯ ᎬᏂᎨᏒ ᏄᏩᏁᎴ ᏚᏓᏂᎸᏤᎸ ᎤᎵᏍᎪᎸᏔᏅᎯ ᎨᏒᎢ; ᎾᏍᎩᏃ ᏄᏛᏁᎸ ᎬᏗᎭ ᎧᏁᎦ ᎾᏍᏉ ᎤᏲᎱᏒᎯ ᏥᎩ.

source: By faith Enoch was taken up to heaven so that he did not see death; he was seen no longer, for God took him away: for before he was taken, witness had been given that he was well-pleasing to God:
chr: ᎦᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎢᎾᎩ ᎠᎦᏘᎾᏫᏛᎮ ᎾᏍᎩ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎤᎪᏩᏛᏗᏱ ᏂᎨᏒᎾ; ᎠᎴ ᎥᏝ ᏯᏥᏩᏛᎮᎢ, ᎤᏁᎳᏅᎯᏰᏃ ᎤᏘᎾᏫᏛᎮᎢ; ᎠᏏᏉᏰᏃ ᎾᎦᏘᎾᏫᏗᏍᎬᎾ ᎨᏎ ᎤᏁᎳᏅᎯ ᎣᏏᏳ ᎤᏰᎸᏗ ᎨᏒ ᏚᎸᏫᏍᏓᏁᎲ ᎬᏂᎨᏒ ᎾᎬᏁᎴᎢ.

source: And without faith it is not possible to be well-pleasing to him, for it is necessary for anyone who comes to God to have the belief that God is, and that he is a rewarder of all those who make a serious search for him.
chr: ᎪᎯᏳᏗᏍᎩᏂ ᎨᏒ ᏂᏛᏗᏍᎬᎾ ᏱᎩ ᎬᏩᏟᏍᏗ ᎣᏍᏛ ᎤᏰᎸᏗ [ᎤᏁᎳᏅᎯ] ᏗᎩᎸᏫᏍᏓᏁᏗᏱ; ᎩᎶᏰᏃ ᎤᏁᎳᏅᎯ ᏱᎦᎷᏤᎭ ᎠᏎ ᏱᎪᎯᏳᎲᏍᎦ ᎡᎲᎢ, ᎠᎴ ᎾᏍᎩ ᏗᎫᏴᎡᎯ ᎨᏒ ᎤᎵᏂᎩᏛ ᎬᏩᏲᎯ.

source: By faith Noah, being moved by the fear of God, made ready an ark for the salvation of his family, because God had given him news of things which were not seen at the time; and through it the world was judged by him, and he got for his heritage the righteousness which is by faith.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᏃᏯ, ᎤᏁᎳᏅᎯ ᎤᏪᏯᏔᏅ ᎤᏁᎢᏍᏓᏁᎸ ᏧᏓᎴᏅᏛ ᎠᏏ ᎤᎪᎲᎯ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎤᎾᏰᏎᎢ, ᎤᏛᏅᎢᏍᏔᏁ ᏥᏳ ᎤᎾᎵᏍᏕᎸᏙᏗ ᏚᏓᏘᎾᎥᎢ; ᎾᏍᎩ ᏄᏛᏁᎸ ᎤᏮᏔᏁ ᏚᏭᎪᏓᏁᎴ ᎡᎶᎯ, ᎠᎴ ᎤᏤᎵ ᏄᎵᏍᏔᏁ ᎾᏍᎩ ᏚᏳᎪᏛ ᎨᏒ ᎪᎯᏳᏗ ᎨᏒ ᏨᏗᏓᎴᎲᏍᎦ.

source: By faith Abraham did as God said when he was ordered to go out into a place which was to be given to him as a heritage, and went out without knowledge of where he was going.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎡᏆᎭᎻ ᎾᎯᏳ ᎠᏥᏯᏅᎲ ᎢᎸᎯᏢ ᎤᏪᏅᏍᏗᏱ ᎾᏍᎩ ᎾᎿ ᎣᏂ ᎢᏴᏛ ᎤᏤᎵᎦ ᎢᏯᎬᏁᏗ ᎨᏒᎢ, ᏧᏬᎯᏳᏁᎢ; ᎠᎴ ᏧᏄᎪᏤᎢ ᎾᎦᏔᎲ ᎾᎿ ᎠᎢᏒᎢ.

source: By faith he was a wanderer in the land of the agreement, as in a strange land, living in tents with Isaac and Jacob, who had a part with him in the same heritage:
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎡᏙᎯᏉ ᎢᏳᏍᏗ ᎤᏪᏙᎴ ᎾᎿ ᎠᏥᏚᎢᏍᏓᏁᎸ ᎦᏙᎯ, ᏅᏩᎾᏓᎴ ᎤᎾᏤᎵᎪᎯ ᎾᏍᎩᏯ, ᏕᎦᎵᏦᏛᏉ ᎠᏁᎮ ᎢᏧᎳᎭ ᎡᏏᎩ ᎠᎴ ᏤᎦᏈ, ᎾᏍᎩ ᎤᎾᏠᏯᏍᏗᏍᎩ ᏥᎨᏎ ᎤᏠᏱ ᎠᏚᎢᏍᏔᏅᎯ ᎨᏒᎢ.

source: For he was looking for the strong town, whose builder and maker is God.
chr: ᎠᎦᏖᏃᎮᏰᏃ ᎦᏚᎲᎢ ᏗᎦᎫᏍᏓᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏁᏍᎨᎲᎢ ᎠᎴ ᎤᏬᏢᏅᎯ ᏥᎩ.

source: And by faith Sarah herself had power to give birth, when she was very old, because she had faith in him who gave his word;
chr: ᎪᎯᏳᏗ ᎨᏒ ᎾᏍᏉ ᎬᏗᏍᎬ ᏎᎵ ᎤᏩᏒ ᏧᎵᏂᎪᏎ ᏰᎵᏉ ᎬᏩᏁᎵᎢᏍᏗ ᏥᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᎠᏲᎵ ᏧᎾᏄᎪᏫᏎ ᎿᏉ ᏧᏓᎾᏄᎪᏫᏍᏗᏱ ᎤᎶᏐᏁᎸᎯ ᏥᎨᏎᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏄᏓᎵᏓᏍᏛᎾ ᎤᏰᎸᏅ ᎾᏍᎩ Ꮎ ᎤᏚᎢᏍᏔᏅᎯ ᎨᏒᎢ.

source: So that from one man, who was near to death, came children in number as the stars in heaven, or as the sand by the seaside, which may not be numbered.
chr: ᎾᏍᎩᏃ ᎠᏏᏴᏫ ᎨᏒ ᏧᎾᏓᎴᏁᎢ ᎠᎴ ᎾᏍᎩ ᎤᏲᎱᏒᎯᏉ ᎾᏍᎩᏯ ᎨᏒᎢ, ᏃᏈᏏ ᎦᎸᎶ ᏣᏂᎧᎳ ᏥᏄᏂᏧᏈᏍᏗ ᎢᏳᏂᏧᏈᏍᏗ, ᎠᎴ ᏃᏳ ᎠᎺᏉᎯ ᎤᏣᏘ ᏥᎦᎳᎨᏴ ᎬᏎᎰᎲᏍᏗ ᏂᎨᏒᎾ ᏥᎩ ᎢᏳᏂᏧᏈᏍᏗ.

source: All these came to their end in faith, not having had the heritage; but having seen it with delight far away, they gave witness that they were wanderers and not of the earth.
chr: ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᎬᏩᏃᎯᏳᎯ ᏚᏂᏲᎱᏎᎢ, ᏂᏚᎾᏓᏂᎸᏨᎾ ᎾᏍᎩ Ꮎ ᎨᏥᏚᎢᏍᏓᏁᎸᎯ ᎨᏒᎢ, ᎢᏅᏍᎩᏂ ᏫᏓᏂᎪᏩᏘᏍᎨᎢ ᎠᎴ ᏄᎾᏜᏏᏛᎡᎲᎾ ᎨᏎᎢ, ᎠᎴ ᏚᏂᏂᏴᎮᎢ, ᎠᎴ ᎠᏂᏃᎲᏍᎨ ᏅᏩᎾᏓᎴᏉ ᎠᎴ ᎠᏁᏙᎯᏉ ᎨᏒ ᎠᏂ ᎡᎶᎯ.

source: For those who say such things make it clear that they are searching for a country for themselves.
chr: ᎾᏍᎩᏰᏃ ᎯᎠ ᎢᏯᏂᏪᏍᎩ, ᎬᏂᎨᏒᎢᏳ ᎾᏅᏁᎰ ᎤᎾᏤᎵᎪᎯ ᎤᏂᏲᎲᎢ.

source: And truly if they had kept in mind the country from which they went out, they would have had chances of turning back.
chr: ᎢᏳᏰᏃ ᏳᎾᏅᏖ ᎾᎿ ᏧᏂᏄᎪᏨᎢ ᏳᏫᏜᏅᏓᏕᎴᏉ ᎥᎤᎾᏨᏍᏗᏱ;

source: But now their desire is for a better country, that is to say, for one in heaven; and so it is no shame to God to be named their God; for he has made ready a town for them.
chr: ᎪᎯᏍᎩᏂ ᎤᏟ ᎢᏲᏍᏛ ᎤᎾᏤᎵᎪᎯ ᎤᏂᏲᎭ, ᎾᏍᎩ ᎦᎸᎶᎢ ᏗᏍᏆᏂᎪᏛᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᎥᏝ ᏯᏕᎰᏍᎦ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎠᎪᏎᏗᏱ; ᏚᏛᏅᎢᏍᏓᏁᎸᏰᏃ ᎦᏚᎲᎢ.

source: By faith Abraham made an offering of Isaac, when he was tested: and he with whom the agreement had been made gave up as an offering the only son of his body,
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎡᏆᎭᎻ, ᎾᎯᏳ ᎠᏥᎪᎵᏰᎥ ᎡᏏᎩ ᎤᎵᏍᎪᎸᏔᏁᎢ; ᎠᎴ ᎾᏍᎩ Ꮎ ᎠᏥᏚᎢᏍᏓᏁᎸᎯ ᎨᏒ ᎤᏩᏒᎯᏳ ᎤᏪᏥ ᎤᎵᏍᎪᎸᏔᏁᎢ.

source: Of whom it had been said, From Isaac will your seed take their name:
chr: ᎾᏍᎩ Ꮎ ᎯᎠ ᎢᏯᏥᏪᏎᎸᎯ ᏥᎨᏎᎢ, ᎾᏍᎩ ᎡᏏᎩ ᏚᏙᎥ ᎨᏥᏯᏅᏗᏍᎨᏍᏗ ᏣᏁᏢᏔᏅᎯ ᎨᏒᎢ;

source: Judging that God was able to give life even to the dead; and because of this he did get him back as if from death.
chr: ᎤᏁᏔᏅᎯ ᏰᎵᏉ ᏄᎵᏂᎬᎦ ᏧᎴᏙᏗᏱ ᎡᎵᏍᎨᎢ, ᎾᏍᏉ ᎤᏲᎱᏒᎯ ᏱᎩ; ᎾᎿ ᎾᏍᏉ ᏥᏚᏓᏂᎸᏤ ᏗᏟᎶᏍᏔᏅᎯ ᎾᏍᎩᏯᎢ.

source: By faith Isaac, blessing Jacob and Esau, gave news of things to come.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎡᏏᎩ ᎣᏍᏛ ᏥᏚᏁᏤᎴ ᏤᎦᏈ ᎠᎴ ᎢᏐ ᎪᎱᏍᏗ ᎠᏏ ᎤᎵᏰᎢᎶᎯᏍᏗ ᎨᏒ ᎤᎬᏩᎵ.

source: By faith Jacob gave a blessing to the two sons of Joseph, when he was near to death; and gave God worship, supported by his stick.
chr: ᏤᎦᏈ ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬᎢ, ᎿᏉ ᎠᏲᎱᏍᎨᎢ ᎣᏍᏛ ᏚᏁᏤᎴ ᎢᏧᎳ ᏦᏩ ᏧᏪᏥ; ᎠᎴ ᎤᏓᏙᎵᏍᏔᏁ ᎤᏙᎳᏅᏍᏗᏱ ᎤᏍᎪᎵ [ᎤᎵᏍᏕᎸᏕᎢ.]

source: By faith Joseph, when his end was near, said that the children of Israel would go out of Egypt; and gave orders about his bones.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᏦᏩ ᎿᏉ ᎠᏲᎱᏍᎨᎢ, ᎤᏁᎢᏍᏔᏁ ᎢᏏᎵ ᏧᏪᏥ ᎤᎾᏓᏅᏍᏗᏱ; ᎠᎴ ᏧᏁᏤ ᏧᎪᎳ ᎤᎬᏩᎵ.

source: By faith Moses was kept secretly by his father and mother for three months after his birth, because they saw that he was a fair child; and they had no fear of the king's orders.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎠᏅᏗᏍᎬ ᎼᏏ ᏧᎦᏴᎵᎨ ᎾᎯᏳ ᎤᏕᏅ ᏦᎢ ᎢᏯᏅᏙ ᏥᎬᏩᏍᎦᎸᏁᎢ, ᎠᏂᎪᏩᏘᏍᎨᏰᏃ ᎤᏬᏚᎯᏳ ᎨᏒ ᎠᏲᎵ; ᎥᏝ ᎠᎴ ᏯᏂᏍᎦᎢᎮ ᎤᎬᏫᏳᎯ ᎤᏁᏨᎢ.

source: By faith Moses, when he became a man, had no desire to be named the son of Pharaoh's daughter;
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎼᏏ ᎿᏉ ᎤᏔᏅ ᏄᎵᏍᏔᏅ ᎤᏲᎢᏎᎴᏉ ᏇᎵᏲ ᎤᏪᏥ ᎠᎨᏴ, ᎤᏪᏥ ᎠᎪᏎᏗᏱ;

source: Feeling that it was better to undergo pain with the people of God, than for a short time to have a taste of the pleasures of sin;
chr: ᎤᏑᏰᎭ ᎤᏟ ᎤᏰᎸᏁ ᎤᏁᎳᏅᎯ ᏧᏤᎵ ᏴᏫ ᎠᏂᎩᎵᏲᏥᏙᎲ ᎤᏠᏯᏍᏙᏗᏱ, ᎠᏃ ᎠᏍᎦᏂ ᏞᎦ ᎣᏍᏛ ᎤᏓᏓᏅᏓᏗᏍᏙᏗ ᎨᏒᎢ;

source: Judging a part in the shame of Christ to be better than all the wealth of Egypt; for he was looking forward to his reward.
chr: ᎤᏟ ᎦᎸᏉᏗᏳ ᎡᎵᏍᎨ ᎦᏰᏥᏐᏢᏙᏗᏱ ᎦᎶᏁᏛ ᎨᏒ ᎢᏳᏍᏗ, ᎠᏃ ᏧᎬᏩᎶᏗ ᎠᏍᏆᏂᎪᏛ ᎢᏥᏈᏱ; ᎠᎦᎫᏴᎡᏗᏰᏃ ᎨᏒ ᎢᏴᏛ ᏫᏓᎧᏂᏍᎨᎢ.

source: By faith he went out of Egypt, not being turned from his purpose by fear of the wrath of the king; for he kept on his way, as seeing him who is unseen.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎢᏥᏈᏱ ᎤᏓᏅᏎᎢ, ᎾᏍᎦᎢᎲᎾ ᎨᏎ ᎤᎬᏫᏳᎯ ᎤᏔᎳᏬᏍᎬᎢ; ᎬᏂᏗᏳᏍᎩᏂ ᎨᏒ ᎾᏍᎩᏯᏉ ᏣᎪᏩᏘᏍᎪ ᎾᏍᎩ Ꮎ ᎦᏰᏥᎪᏩᏛᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: By faith he kept the Passover, and put the sign of the blood on the houses, so that the angel of destruction might not put their oldest sons to death.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎤᏁᏤ ᎧᏃᎯᏰᎩ ᏗᎵᏍᏓᏴᏗᏱ ᎤᏂᏍᏆᏂᎪᏙᏗᏱ, ᎠᎴ ᎩᎬ ᎤᏂᏍᏚᏟᏍᏗᏱ [ᎦᎶᎯᏍᏗᏱ,] ᎾᏍᎩ ᎢᎬᏱ ᎤᎾᏕᏅᎯ ᏗᏛᏗᏍᎩ ᎪᎱᏍᏗ ᎤᏅᏁᏗᏱ ᏂᎨᏒᎾ.

source: By faith they went through the Red Sea as if it had been dry land, though the Egyptians were overcome by the water when they made an attempt to do the same.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎠᏅᏗᏍᎬ ᎠᎺᏉᎯᎩᎦᎨᏍᏛᏱ ᎠᏰᎵ ᎤᏂᎶᏎ ᎤᎧᏲᏛᎯ ᏣᏂᎶᏍᎪ ᎾᏍᎩᏯᎢ; ᎢᏥᏈᏱᏃ ᎠᏁᎯ ᎤᎾᏁᎶᏔᏅ ᎾᏍᎩ ᎢᏳᎾᏛᏁᏗᏱ ᏚᏂᎬᏤᎢ.

source: By faith the walls of Jericho came down, after they had been circled for seven days.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎠᏅᏗᏍᎬ ᏓᏐᏴ ᏤᎵᎪ ᏚᏪᏒᏙᎠᏎᎢ, ᎿᏉ ᎦᎵᏉᎩ ᏧᏒᎯᏛ ᏂᏚᎾᏚᏫᏍᏔᏁᎢ.

source: By faith Rahab, the loose woman, was not put to death with those who had gone against God's orders, because she had taken into her house in peace those sent to see the land.
chr: ᎪᎯᏳᏗ ᎨᏒ ᎬᏗᏍᎬ ᎴᎭᏫ ᎤᏁᎫᏥᏛ ᎥᏝ ᏯᏥᏛᏔᏁ ᎨᏥᏛᏔᏅ ᎾᏍᎩ Ꮎ ᏄᏃᎯᏳᏒᎾ ᏥᎨᏎᎢ, ᎾᏍᎩ ᏙᎯᏱ ᏥᏚᏓᏂᎸᏤ ᎢᏳᏍᏗ ᎤᏂᎦᏛᏂᏙᎯ.

source: What more am I to say? For there would not be time to give the stories of Gideon, Barak, Samson, and Jephthah, of David and Samuel and the prophets:
chr: ᎠᎴ ᎦᏙ ᎠᏏ ᏓᎦᏛᏂ? ᎥᏝᏰᏃ ᎬᎩᏍᏆᏗᏍᏗ ᏱᎩ ᏱᎦᏥᏃᎮᎸ ᎩᏗᏯᏂ, ᎠᎴ ᏇᎴᎩ, ᎠᎴ ᏌᎻᏏᏂ, ᎠᎴ ᏤᏈᏓ; ᏕᏫ ᎾᏍᏉ, ᎠᎴ ᏌᎻ, ᎠᎴ ᎠᎾᏙᎴᎰᏍᎩ.

source: Who through faith overcame kingdoms, did righteousness, got their reward, kept the mouths of lions shut,
chr: ᎾᏍᎩ ᎪᎯᏳᏗ ᎨᏒ ᎠᏅᏗᏍᎬ ᎠᏰᎵ ᏕᎪᏢᏒ ᏥᏓᎾᏓᎵᏁᎯᏕᎮᎢ, ᏚᏳᎪᏛ ᏥᏚᏂᎸᏫᏍᏓᏁᎮᎢ, ᎤᎾᏤᎵ ᏥᎾᏅᏁᎮ ᏄᏍᏛ ᎨᏥᏚᎢᏍᏓᎸᎢ, ᏢᏓᏥ ᎤᏂᏃᏕᏅ ᏗᏂᎰᎵ ᏥᏓᏂᏍᏚᎲᏍᎨᎢ,

source: Put out the power of fire, got safely away from the edge of the sword, were made strong when they had been feeble, became full of power in war, and put to flight the armies of the nations.
chr: ᎠᏥᎸ ᎤᏍᎦᏎᏗ ᏣᏅᏜᏗᏍᎨᎢ, ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᏣᎾᏗᏫᏎᎮᎢ, ᏗᏂᏩᎾᎦᎳ ᎨᏒ ᏧᎾᎵᏂᎩᏛ ᏥᏂᎨᎬᏁᎮᎢ, ᎾᏂᏍᎦᎢᎲᎾ ᏂᎾᎾᎵᏍᏗᏍᎨ ᏓᎾᎵᎲᎢ, ᏥᏓᏂᎨᎯᏙᎮ ᏅᏩᎾᏓᎴ ᎠᏂᏯᏫᏍᎩ.

source: Women had their dead given back to them living; others let themselves be cruelly attacked, having no desire to go free, so that they might have a better life to come;
chr: ᎠᏂᎨᏴ ᏗᎬᏩᏂᏲᎱᎯᏎᎸᎯ ᏗᏅᏃᏛ ᏔᎵᏁ ᏂᏙᎨᏥᏲᎯᏎᎮᎢ; ᎢᎦᏛᏃ ᏥᎨᏥᎩᎸᏍᎨᎢ, ᏂᏓᎾᏓᏂᎸᎬᎾ ᎨᎫᏓᎴᏍᎬᎢ; ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎤᏟ ᎢᏲᏍᏛ ᎤᏂᏩᏛᏗᏱ ᎤᎾᏚᎵᏍᎬ ᏗᎴᎯᏐᏗ ᎨᏒᎢ;

source: And others were tested by being laughed at or by blows, and even with chains and prisons:
chr: ᎢᎦᏛᏃ ᎨᏥᎪᎵᏰᏍᎨ ᎦᎨᏥᏐᏢᏗᏍᎬ ᎠᎴ ᏕᎨᏥᎵᎥᏂᎲᎢ, ᎠᎴ ᎾᏍᏉ ᏕᎨᎦᎸᎢᎲ ᎠᎴ ᏕᎨᏥᏍᏚᎲᏍᎬᎢ;

source: They were stoned, they were cut up with knives, they were tested, they were put to death with the sword, they went about in sheepskins and in goatskins; being poor and in pain and cruelly attacked,
chr: ᏅᏯ ᏕᎨᎬᏂᏍᏗᏍᎨᎢ, ᏗᎦᏄᏙᎩ ᎬᏗ ᏕᎨᏥᎦᎵᏍᎨᎢ, ᏕᎨᏥᎪᎵᏰᏍᎨᎢ, ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᏕᎨᏥᎢᏍᏗᏍᎨᎢ; ᎠᏫ ᎤᏂᏃᏕᎾ ᎠᎴ ᎠᏫ ᏗᏂᎭᏄᎸᎯ ᏧᏂᏁᎦᎸᏅᎯ ᏧᎾᏄᏩᎢ ᎠᏁᏙᎮᎢ; ᎤᏂᏂᎬᏎᎯ ᎨᏎᎢ, ᎠᏂᎩᎵᏲᏥᏙᎮᎢ.

source: Wandering in waste places and in mountains and in holes in the rocks; for whom the world was not good enough.
chr: [ᎾᏍᎩ ᎯᎠ ᎥᏝ ᎡᎶᎯ ᎬᏩᎾᏕᏗ ᏱᎨᏎᎢ;] ᎢᎾᎨ ᎠᏁᏙᎮᎢ, ᎠᎴ ᏙᏓᎸᎢ, ᎠᎴ ᏚᏍᏓᎦᎸᎢ, ᎠᎴ ᎦᏙᎯ ᏓᏔᎴᏒᎢ.

source: And not one of these got the good things of the agreement, though they all had a good record through faith,
chr: ᎠᎴ ᎾᏍᎩ ᏂᎦᏛ ᎯᎠ ᎣᏍᏛ ᎨᏥᏃᎮᏍᎩ ᏥᎨᏎ ᎤᏃᎯᏳᏒ ᎢᏳᏩᏂᏌᏛ, ᎥᏝ ᏄᏍᏛ ᎨᏥᏚᎢᏍᏓᏁᎸ ᏱᏚᎾᏓᏂᎸᏤᎢ;

source: Because God had kept some better thing for us, so that it was not possible for them to become complete without us.
chr: ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎢᎦᏛᏅᎢᏍᏓᏁᎸᎯ ᎨᏒ ᎢᏳᏍᏗ ᎪᎱᏍᏗ ᎤᏟ ᎢᏲᏍᏛ, ᎾᏍᎩ ᏄᏂᎷᎶᏤᎲᎾ ᎢᎨᎬᏁᏗᏱ ᏂᎨᏒᎾ ᎠᏴ ᏂᎦᏠᏯᏍᏗᏍᎬᎾ.

source: For this reason, as we are circled by so great a cloud of witnesses, putting off every weight, and the sin into which we come so readily, let us keep on running in the way which is marked out for us,
chr: ᎾᏍᎩᏃ ᎢᏳᏂᏧᏈᏍᏗ ᎠᏂᎦᏔᎯ ᏥᏕᎨᎦᏚᏫᏍᏗ, ᎢᏴᏛ ᏂᏛᏁᏓ ᏄᏓᎴᏒ ᎦᎨᏛ ᎢᎬᏁᎯ, ᎠᎴ ᎠᏍᎦᏂ ᎠᎯᏛ ᎨᎦᏢᏔᏍᏗ ᏥᎩ, ᎠᎴ ᏗᏛᏂᏗᏳ ᎨᏎᏍᏗ ᎢᏓᏙᎩᏯᏍᎨᏍᏗ ᎠᏙᎩᏯᏍᏗ ᎢᎬᏱᏗᏢ ᏁᎬᏁᎸᎢ,

source: Having our eyes fixed on Jesus, the guide and end of our faith, who went through the pains of the cross, not caring for the shame, because of the joy which was before him, and who has now taken his place at the right hand of God's seat of power.
chr: ᏫᏕᏓᎦᏂᏍᎨᏍᏗ ᏥᏌ ᎾᏍᎩ ᎢᏳᏩᏂᏌᏛ, ᎠᎴ ᎠᏍᏆᏗᏍᎩ ᏥᎩ ᎢᎪᎯᏳᏒᎢ. ᎾᏍᎩ ᎤᎵᎮᎵᏍᏗ ᎨᏒ ᎢᎬᏱᏗᏢ ᎾᎬᏁᎸ ᎢᏳᏍᏗ ᎬᏂᏗᏳ ᏓᏓᎿᏩᏍᏛ ᎤᎩᎵᏲᏤᎢ, ᎤᎵᏌᎵᏉ ᎤᏰᎸᏎ ᎤᏕᎰᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎠᎦᏘᏏᏗᏢ ᎤᏪᏅ ᎤᏁᎳᏅᎯ ᎤᏪᏍᎩᎸᎢ.

source: Give thought to him who has undergone so much of the hate of sinners against himself, so that you may not be tired and feeble of purpose.
chr: ᎡᏣᏓᏅᏛᎵᏉᏍᎩᏂ Ꮎ ᎾᏍᎩ ᎢᎦᎢ ᎦᎬᏩᏐᏢᏛ ᎠᏂᏍᎦᎾ ᎤᏁᎳᎩ ᏚᏪᎵᏎᎸᎢ, ᎾᏍᎩᏃ ᏞᏍᏗ ᏗᏥᏯᏪᏨᎩ ᎠᎴ ᏞᏍᏗ ᏧᏩᎾᎦᎶᏨᎩ ᏕᏣᏓᏅᏛᎢ.

source: Till now you have not given your blood in your fight against sin:
chr: ᎥᏝ ᎠᏏ ᎢᏥᎩᎬ ᎤᏨᎢᏍᏗᏱ ᎢᏴᏛ ᏱᏗᏣᏟᏴᎲ ᎠᏍᎦᏂ ᏕᏣᏟᏴᎡᎲᎢ.

source: And you have not kept in mind the word which says to you as to sons, My son, do not make little of the Lord's punishment, and do not give up hope when you are judged by him;
chr: ᎠᎴ ᎢᏨᎨᏫᏒᎯ ᎢᎩ ᎡᏥᏬᏁᏗᏍᎬ ᏗᏂᏲᎵ ᏥᎨᏥᏬᏁᏗᏍᎪ ᎾᏍᎩᏯᎢ, ᎯᎠ ᏥᏂᎦᏪᎭ, ᎠᏇᏥ ᏞᏍᏗ ᏅᎵᏌᎵ ᏱᏣᏰᎸᏎᏍᏗ ᎤᎬᏫᏳᎯ ᏣᎩᎵᏲᎢᏍᏗᏍᎬᎢ, ᎠᎴ ᏞᏍᏗ ᏩᎾ ᎯᏳᏏᎦᎶᎨᏍᏗ ᏣᎬᏍᎪᎸᎢᏍᎨᏍᏗ,

source: For the Lord sends punishment on his loved ones; everyone whom he takes as his son has experience of his rod.
chr: ᎾᏍᎩᏰᏃ Ꮎ ᎤᎬᏫᏳᎯ ᎤᎨᏳᎯ ᎠᎩᎵᏲᎢᏍᏗᏍᎪᎢ, ᎠᎴ ᏕᎦᎵᎥᏂᎰ ᎾᏂᎥ ᏧᏪᏥ ᎾᏍᎩ ᏧᏓᏂᎸᏨᎯ ᎨᏒᎢ.

source: It is for your training that you undergo these things; God is acting to you as a father does to his sons; for what son does not have punishment from his father?
chr: ᎢᏳᏃ ᎡᏥᎩᎵᏲᎢᏍᏗᏍᎨᏍᏗ, ᎾᏍᎩᏯ ᏧᏪᏥ ᏂᏓᏛᏁᎲ ᏂᏣᏛᏁᎭ ᎤᏁᎳᏅᎯ; ᎦᎪᏰᏃ ᎡᎭ ᎠᏲᎵ ᎾᏍᎩ ᎤᏙᏓ ᏄᎩᎵᏲᎢᏍᏗᏍᎬᎾ?

source: But if you have not that punishment of which we all have our part, then you are not true sons, but children of shame.
chr: ᎢᏳᏍᎩᏂ ᎢᎸᎯᏳ ᏁᏥᎩᎵᏲᎢᏍᏗᏍᎬᎾ ᏱᎩ, ᎾᏍᎩ ᏂᎦᏗᏳ ᏗᏂᏲᎵ ᎾᏍᎩ ᎢᎨᎬᏁᏗ ᏥᎩ, ᎿᏉ ᎢᏴᏛᏉ ᎢᏣᏕᏂᏙᎸᎯ, ᎥᏝᏃ ᎣᏍᏛ ᎢᏣᏕᏅᎯ ᏱᎩ.

source: And again, if the fathers of our flesh gave us punishment and had our respect, how much more will we be under the authority of the Father of spirits, and have life?
chr: ᎠᎴᏬ, ᎤᏇᏓᎵ ᎨᏒ ᏗᎩᏙᏓ ᏕᎨᎲᎩ, ᎾᏍᎩ ᏥᎨᎩᎩᎵᏲᎢᏍᏗᏍᎬᎩ; ᎠᎴ ᎨᏗᎸᏉᏗᏳ ᏥᎨᏒᎩ; ᏝᏍᎪ ᎤᏟ ᏱᏂᏙᎬᏩᏳᎪᏗ ᏤᏓᏓᏲᎯᏎᏗᏱ ᏗᎦᏓᏅᏙ ᏧᏬᏢᏅᎯ ᏥᎩ, ᎠᎴ ᎢᎦᏛᏂᏗᏍᏗᏱ?

source: For they truly gave us punishment for a short time, as it seemed good to them; but he does it for our profit, so that we may become holy as he is.
chr: ᎾᏍᎩᏰᏃ Ꮎ ᎤᏙᎯᏳᎯ ᏞᎦ ᎨᎩᎩᎵᏲᎢᏍᏗᏍᎬᎩ ᎤᏅᏒ ᎠᎾᏓᏅᏖᏍᎬ ᎾᎾᏛᏁᎲᎩ; [ᎤᏁᎳᏅᎯᏍᎩᏂ] ᎣᏍᏛ ᎢᎦᎵᏍᏓᏁᏗ ᎤᎬᏩᎸ, ᎾᏍᎩ ᎢᏣᏠᏯᏍᏗᏍᎩ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏩᏒ ᎠᏍᎦᎾ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: At the time all punishment seems to be pain and not joy: but after, those who have been trained by it get from it the peace-giving fruit of righteousness.
chr: ᎠᎴ ᏂᎦᎥᏉ ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒ ᎪᎯ ᎨᏒ ᎥᏝ ᎣᏍᏛ ᎣᏓᏅᏓᏗᏍᏗᏍᎩ ᏱᎩ, ᎤᏲᏉᏍᎩᏂ; ᎣᏂᏍᎩᏂᏃᏅ ᎢᏴᏛ ᏅᏩᏙᎯᏯᏛ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒ ᎦᎾᏄᎪᏫᏍᎪ ᏚᏳᎪᏛ ᎨᏒ ᎤᎾᏄᎪᏫᏒᎯ, ᎾᏍᎩ ᎢᏳᎾᎵᏍᏓᏁᎸᎯ.

source: For this cause let the hands which are hanging down be lifted up, and let the feeble knees be made strong,
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏗᏥᏌᎳᏛᎦ ᏗᏦᏰᏂ ᎡᎳᏗ ᎢᏧᎵᏍᏔᏅᎯ ᏥᎩ, ᎠᎴ ᏗᏥᏂᎨᏂ ᏗᏩᎾᎦᎳᎢ;

source: And make straight roads for your feet, so that the feeble may not be turned out of the way, but may be made strong.
chr: ᎥᎾᏕᏍᎩ ᏂᏨᎦ ᏕᎦᏅᏅ ᎢᏥᎶᎯᏍᏗᏱ, ᎾᏍᎩᏃ ᎠᏲᎤᎵ ᎨᏒ ᏞᏍᏗ ᏳᏂᎪᎸᏍᏔᏁᏍᏗ; ᎧᏅᏬᏗᏉᏍᎩᏂ ᎨᏎᏍᏗ.

source: Let your desire be for peace with all men, and to be made holy, without which no man may see the Lord;
chr: ᏅᏩᏙᎯᏯᏛ ᏕᏥᎧᎿᏩᏗᏎᏍᏗ ᎾᏂᎥᏉ ᎪᎱᏍᏗ ᏕᏣᏓᏛᏗᏍᎬᎢ, ᎠᎴ ᎾᏍᎦᏅᎾ ᎨᏒᎢ, ᎧᏂᎩᏛ ᏱᎩ ᎾᏍᎩ, ᎥᏝ ᎩᎶ ᏰᎵ ᎤᎬᏫᏳᎯ ᎬᏩᎪᏩᏛᏗ ᏱᎩ;

source: Looking with care to see that no man among you in his behaviour comes short of the grace of God; for fear that some bitter root may come up to be a trouble to you, and that some of you may be made unclean by it;
chr: ᎢᏤᏯᏔᎯᏳ ᎨᏎᏍᏗ ᎾᏍᎩᏃ ᏞᏍᏗ ᎩᎶ ᎡᏍᎦ ᎤᏬᎭᏒᎩ ᎤᏁᎳᏅᎯ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒᎢ; ᏞᏍᏗ ᎤᏴᏍᏗ ᎤᎿᏍᏕᏢ ᎦᎾᏄᎪᎬ ᎢᏣᏕᏯᏙᏔᏅᎩ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏩᏂᏌᏛ ᎤᏂᏣᏘ ᎦᏓᎭ ᎢᏳᎾᎵᏍᏔᏅᎩ;

source: And that there may not be any evil liver, or any man without respect for God, like Esau, who let his birthright go for a plate of food.
chr: ᏞᏍᏗ ᎩᎶ ᎤᏕᎵᏛ ᏗᏂᏏᎲᏍᎩ ᏱᏣᏓᏑᏰᏍᏗ, ᎠᎴ ᎠᏍᎦᎾ ᏴᏫ, ᎢᏐ ᎾᏍᎩᏯᎢ, ᎤᏍᎩ ᏌᏉᏉ ᎢᏯᎵᏍᏓᏴᏗ ᏥᏚᎬᏩᎶᏔᏁ ᏧᎾᏗᏅᏎ ᎢᎬᏱ ᎡᎯ ᎨᏒᎢ.

source: For you have knowledge that even long after, when he was desiring the blessing for his heritage, he was turned away, though he made his request frequently and with weeping; because the past might not be changed.
chr: ᎢᏥᎦᏔᎭᏰᏃ ᎣᏂ ᎢᏴᏛ ᎣᏍᏛ ᎢᏯᎦᏛᏁᏗᏱ ᏧᏚᎵᏍᎨ ᏣᏥᏐᏅᎢᏍᏔᏁᎢ; ᎥᏝᏰᏃ [ᎤᏙᏓ] ᎤᏓᏅᏛ ᎬᏩᏁᏟᏴᏍᏗ ᎨᏒ ᏳᏩᏛᎮᎢ, ᎤᎵᏏᎾᎯᏍᏗᏳᏍᎩᏂᏃᏅ ᎠᎴ ᏗᎬᎦᏌᏬᎢᎯ ᎤᏲᎴᎢ.

source: You have not come to a mountain which may be touched, and is burning with fire, and to a black cloud, and a dark smoke, and a violent wind,
chr: ᎥᏝᏰᏃ ᎣᏓᎸ ᎬᏒᏂᏍᏗ ᎨᏒ ᏱᏥᎷᏨ, ᎠᎴ ᎾᏍᎩ ᏣᏓᏪᎵᎩᏍᎨᎢ, ᎥᏝ ᎠᎴ ᎬᎿᎨ ᎤᎶᎩᎸᎢ, ᎠᎴ ᎤᎵᏏᎩᏳ ᎰᏒ ᎠᎴ ᎦᏃᎸᎥᏍᎬᎢ,

source: And to the sound of a horn, and the voice of words, the hearers of which made request that not a word more might be said to them:
chr: ᎠᎴ ᎠᏤᎷᎩ ᎤᏃᏴᎬᎢ, ᎠᎴ ᎧᏁᎬ ᎤᏃᏴᎬᎢ; ᎾᏍᎩᏃ ᎤᎾᏛᎦᏅᎯ ᎤᏂᏔᏲᎴ ᏔᎵᏁ ᎾᏍᎩ ᎢᎨᏂᏪᏎᏗᏱ ᏂᎨᏒᎾ.

source: For the order which said, If the mountain is touched even by a beast, the beast is to be stoned, seemed hard to them;
chr: ᎥᏝᏰᏃ ᎣᏏᏳ ᏳᏂᏰᎸᏁ ᏄᏍᏛ ᎤᎵᏁᏨᎢ, ᎾᏍᎩ ᎦᎾᏜᎢᏉ ᎾᏍᏉ ᏳᏃᏟᏍᏔ ᎣᏓᎸᎢ ᎠᏎ ᏅᏯ ᏣᎬᏂᏍᏙᏗ ᎨᏒᎢ, ᎠᎴ ᎠᏥᏲᏍᏗᏉ ᎨᏒ ᏗᎬᏩᎶᏒᎯ.

source: And the vision was so overpowering that even Moses said, I am shaking and full of fear.
chr: ᎠᎴ ᎤᏂᎪᎲ ᎤᏣᏘ ᎤᎾᏰᎯᏍᏗᏳ ᎨᏒ ᎾᏍᎩ ᎢᏳᏍᏗ ᎼᏏ ᎯᎠ ᏄᏪᏎᎢ, ᎤᏣᏘ ᏥᎾᏰᏍᎦ ᎠᎴ ᎠᎩᎾᏫᎭ.

source: But you have come to the mountain of Zion, to the place of the living God, to the Jerusalem which is in heaven, and to an army of angels which may not be numbered,
chr: ᏌᏯᏂᏍᎩᏂ ᎣᏓᎸ ᎢᏥᎷᏨ, ᎠᎴ ᎬᏂᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎦᏚᎲᎢ, ᎾᏍᎩ ᏥᎷᏏᎵᎻ ᎦᎸᎳᏗ ᎡᎯ, ᎠᎴ ᏗᎬᏎᎰᎲᏍᏗ ᏂᎨᏒᎾ ᎨᏥᏅᏏᏓᏍᏗ ᏧᎾᏓᏡᎬᎢ,

source: To the great meeting and church of the first of those who are named in heaven, and to God the judge of all, and to the spirits of good men made complete,
chr: ᎠᎴ ᎾᎿ ᏂᎦᏗᏳ ᎤᎾᏓᏟᏌᎲᎢ, ᎠᎴ ᎢᎬᏱ ᎤᎾᏕᏅᎯ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬᎢ, ᎾᏍᎩ [ᏚᎾᏙᎥ] ᎦᎸᎳᏗ ᏥᏕᎪᏪᎳ, ᎠᎴ ᎾᎿ ᎤᏁᎳᏅᎯ ᏂᎦᏗᏳ ᏗᎫᎪᏓᏁᎯ [ᎡᎲᎢ,] ᎠᎴ ᎾᎿ ᏧᎾᏓᏅᏙ ᎤᎾᏓᏅᏘ ᏴᏫ ᎾᏂᏍᎦᏅᎾ ᎢᎨᎬᏁᎸᎯ [ᎠᏁᎲᎢ,]

source: And to Jesus by whom the new agreement has been made between God and man, and to the sign of the blood which says better things than Abel's blood.
chr: ᎠᎴ ᎾᎿ ᏥᏌ [ᎡᎲᎢ] ᎾᏍᎩ ᎠᏰᎵ ᎠᎴᎲᏍᎩ ᎢᏤ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎠᎴ ᎾᎿ ᎩᎬ ᎠᏍᏚᏢᎯ ᎨᏒᎢ, ᎾᏍᎩ ᎤᏟ ᎢᏲᏍᏛ ᎠᏔᏲᎯᎯ ᏥᎩ ᎡᏍᎦᏉ ᎡᏈᎵ [ᎤᎩᎬ.]

source: See that you give ear to his voice which comes to you. For if those whose ears were shut to the voice which came to them on earth did not go free from punishment, what chance have we of going free if we give no attention to him whose voice comes from heaven?
chr: ᎢᏤᏯᏔᎮᏍᏗ ᏞᏍᏗᏉ ᎡᏥᏲᎢᏎᎸᎩ ᎾᏍᎩ Ꮎ ᏥᎧᏁᎦ. ᎢᏳᏰᏃ ᏄᎾᏓᏗᏫᏎᎸᎾ ᏱᎩ ᎾᏍᎩ Ꮎ ᎤᏂᏲᎢᏎᏛ ᎡᎶᎯ ᎤᏁᏨᎯ, ᎤᏟᎯᏳ ᎬᏩᏟᏍᏗ ᎢᎦᏓᏗᏫᏎᏗᏱ ᎢᏳᏃ ᎢᏴᏛ ᏱᏁᏓᏛᏁᎸ ᎦᎸᎳᏗ ᏨᏗᎧᏁᎦ;

source: Whose voice was the cause of the shaking of the earth; but now he has made an oath, saying, There will be still one more shaking, not only of the earth, but of heaven.
chr: ᎾᏍᎩ Ꮎ ᎧᏁᎬ ᎾᎯᏳ ᎡᎶᎯ ᎤᏖᎸᏁᎢ; ᎠᏎᏃ ᎪᎯ ᎨᏒ ᎤᏚᎢᏍᏔᏅ, ᎯᎠ ᏄᏪᏒ, ᎠᏏ ᏌᏉ ᏅᏓᏥᏖᎸᏂ ᎥᏝ ᎡᎶᎯᏉ ᎤᏩᏒ, ᎦᎸᎶᎢᏍᎩᏂ ᎾᏍᏉ.

source: And the words, Still one more, make it clear that there will be a taking away of those things which are shaking, as of things which are made, so that there may be only those things of which no shaking is possible.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏥᏂᎦᏪᎭ ᎠᏏ ᏌᏉᎢ, ᎾᏍᎩ ᎢᏴᏛ ᎢᏗᎬᏁᏗ ᎨᏒ ᎾᏍᎩ ᏗᏖᎸᏅᎯ ᎨᏒ ᎦᏛᎦ, ᎾᏍᎩ ᏗᎪᏢᏅᎯᏉ ᎾᏍᎩᏯᎢ, ᎾᏍᎩᏃ Ꮎ ᏧᏓᎴᏅᏛ ᏗᎬᏤᎸᏗ ᏂᎨᏒᎾ ᎨᏒ ᎾᎿᏉ ᏗᏍᏆᏂᎪᏙᏗ ᎢᏳᎵᏍᏙᏗᏱ.

source: If then, we have a kingdom which will never be moved, let us have grace, so that we may give God such worship as is pleasing to him with fear and respect:
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᏍᎩ ᎠᏴ ᏗᎦᏓᏂᎸᏨᎯ ᏥᎩ ᎤᎬᏫᏳᎯ ᎤᏤᎵᎪᎯ ᎨᏒ ᎾᏍᎩ ᎬᏖᎸᏗ ᏂᎨᏒᎾ, ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᎩᎮᏍᏗ, ᎾᏍᎩ ᎢᏛᏗᏍᎬ ᎤᏁᎳᏅᎯ ᎣᏍᏛ ᎤᏰᎸᏗ ᏗᎨᎩᎸᏫᏍᏓᏁᏗ ᏱᎩ, ᎦᎸᏉᏗᏳ ᎨᏒ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎦᎾᏰᎯᏍᏗ ᎨᏒ ᏔᎵ ᎢᎬᏗᏕᎬᎢ.

source: For our God is an all-burning fire.
chr: ᎢᎦᏁᎳᏅᎯᏰᏃ ᎠᏥᎸ ᎠᏓᎪᎲᏍᏗᏍᎩ.

source: Go on loving your brothers in the faith.
chr: ᎠᎾᎵᏅᏟ ᏗᎨᏳᏗ ᎨᏒ ᏅᏩᏍᏗᏗᏎᏍᏗᏉ.

source: Take care to keep open house: because in this way some have had angels as their guests, without being conscious of it.
chr: ᏞᏍᏗ ᏱᏨᎨᏫᏍᎨᏍᏗ ᏂᏗᏣᏓᎦᏔᎲᎾ ᏗᏥᏍᏆᏂᎪᏙᏗᏱ; ᎩᎶᏰᏃ ᎾᏍᎩ ᎾᎾᏛᏁᎲ ᎦᎸᎳᏗ ᎠᏁᎯ ᎨᏥᏅᏏᏓᏍᏗ ᏧᏂᏍᏆᏂᎪᏔᏅᎯ ᎢᎩ.

source: Keep in mind those who are in chains, as if you were chained with them, and those who are in trouble, as being yourselves in the body.
chr: ᏕᏣᏅᏓᏗᏍᎨᏍᏗ ᏗᎨᎦᎸᎢᏛ ᎨᏒᎢ, ᎾᏍᎩᏯ ᎢᏧᎳᎭ ᏥᏕᏣᎸᎣᎢ; ᎠᎴ ᎾᏍᎩ Ꮎ ᎤᏲ ᎢᎨᎬᎾᏕᎩ, ᎢᏨᏒᏰᏃ ᎾᏍᏉ ᎠᏰᎸ ᎢᏤᎭ.

source: Let married life be honoured among all of you and not made unclean; for men untrue in married life will be judged by God.
chr: ᏗᏨᏍᏗ ᎨᏒ ᎾᏂᎥᏉ ᎠᏁᎲ ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᎠᎴ ᏓᎾᏤᎲ ᎦᎳᏫᏎᏗ ᏂᎨᏒᎾ ᎨᏎᏍᏗ; ᎤᏕᎵᏛᏍᎩᏂ ᏗᎾᏂᏏᎲᏍᎩ ᎠᎴ ᏗᎾᏓᏲᏁᎯ ᎤᏁᎳᏅᎯ ᏙᏓᎫᎪᏓᏁᎵ.

source: Be free from the love of money and pleased with the things which you have; for he himself has said, I will be with you at all times.
chr: ᏕᏥᎸᏫᏍᏓᏁᎲ ᏞᏍᏗ ᏧᎬᏩᎶᏗ ᎠᎬᎥᎯᏍᏗ ᎨᏒ ᏳᎵᏠᏯᏍᏕᏍᏗ; ᎠᎴ ᏰᎵᏉ ᎢᏥᏰᎵᏎᏍᏗ ᏄᏍᏛ ᎪᎱᏍᏗ ᎢᏥᎲᎢ; ᎯᎠᏰᏃ ᎢᏳᏪᏛ ᎢᎩ, ᎥᏝ ᎢᎸᎯᏳ ᎤᏁᎳᎩ ᏴᎦᎬᏰᎵᏏ, ᎥᏝ ᎠᎴ ᏴᎦᎬᏴᏕᎩ.

source: So that we say with a good heart, The Lord is my helper; I will have no fear: what is man able to do to me?
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏂᏗᎾᏰᏍᎬᎾ ᎯᎠ ᎢᎨᎩᏪᏍᏗ, ᎤᎬᏫᏳᎯ ᎠᎩᏍᏕᎵᏍᎩ, ᎠᎴ ᎥᏝ ᏴᎦᏥᏍᎦᏯ ᏴᏫ ᎢᎦᎬᏋᏁᏗ ᎨᏒᎢ.

source: Keep in mind those who were over you, and who gave you the word of God; seeing the outcome of their way of life, let your faith be like theirs.
chr: ᏕᏣᏅᏓᏗᏍᎨᏍᏗ ᎾᏍᎩ Ꮎ ᎨᏣᎦᏌᏯᏍᏗᏕᎩ, ᎾᏍᎩ Ꮎ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏃᎮᏛ ᎨᏥᎾᏄᎪᏫᏎᎸᎯ; ᎾᏍᎩ ᏄᏍᏛ ᎤᏃᎯᏳᏒ ᎢᏥᏍᏓᏩᏗᏎᏍᏗ, ᎣᏍᏛ ᎢᏣᏓᏅᏖᎯᏌᏛ ᎨᏎᏍᏗ ᏄᏍᏛ ᏭᎵᏰᎢᎶᎸ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ,

source: Jesus Christ is the same yesterday and today and for ever.
chr: ᏥᏌ ᎦᎶᏁᏛ ᏅᏩᏍᏗᏉ ᎤᏒᎯ ᏥᏄᏍᏛ, ᎠᎴ ᎪᎯ ᎢᎦ, ᎠᎴ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ.

source: Do not be turned away by different strange teachings, because it is good for your hearts to be made strong by grace, and not by meats, which were of no profit to those who took so much trouble over them.
chr: ᏞᏍᏗ ᎫᏓᎴᏅᏛ ᎠᎴ ᏂᏥᎦᏔᎲᎾ ᏗᏕᏲᏗ ᎨᏒ ᏱᏗᏣᏘᏂᏙᎮᏍᏗ; ᎣᏏᏳᏰᏃ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏳᎵᏍᏓᏱᏗᏍᏗ ᎣᎾᏫ; ᎥᏝᏃ ᏄᏍᏛᏉ ᎥᎵᏍᏓᏴᎲᏍᎬᎢ, ᎾᏍᎩ ᎪᎱᏍᏗ ᎤᎾᎵᏍᏕᎸᏙᏗ ᏭᎵᏰᎢᎶᎸᎯ ᏂᎨᏒᎾ ᎨᏒ ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᎾᎦᏌᏯᏍᏔᏅᎯ ᎨᏒᎢ.

source: We have an altar from which those priests who are servants in the Tent may not take food.
chr: ᎠᏥᎸ-ᎨᎳᏍᏗᏱ ᎢᎪᏢᎭ, ᎾᎿ ᎥᏝ ᏱᏚᏳᎪᏗ ᎤᎾᎵᏍᏓᏴᏗᏱ ᎦᎵᏦᏛᏉ ᎪᎱᏍᏗ ᎠᎾᏛᏁᎯ ᏥᎩ.

source: For the bodies of the beasts whose blood is taken into the holy place by the high priest as an offering for sin are burned outside the circle of the tents.
chr: ᎠᎴᏬ ᏅᎩ ᏗᏂᏅᏌᏗ ᎤᏂᎩᎬ ᎦᎸᏉᏗᏳ ᏗᎨᏒ ᏥᏫᎦᏁᏨᏍᏗᏍᎨ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎠᏍᎦᏂ ᎠᎫᏴᏙᏗ, ᎾᏍᎩ ᏗᏂᏰᎸ ᎦᎵᏦᏛ ᏙᏱᏗᏢ ᏓᎾᎪᎲᏍᏗᏍᎨᎢ.

source: For this reason Jesus was put to death outside the walls, so that he might make the people holy by his blood.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏥᏌ ᎾᏍᏉ, ᎾᏍᎩ, ᎾᏂᏍᎦᏅᎾ ᎢᏧᏩᏁᏗᏱ ᏴᏫ ᎤᏩᏒ ᎤᎩᎬ ᎬᏗᏍᎬᎢ, ᎦᎶᎯᏍᏗᏱ [ᏥᎷᏏᎵᎻ] ᏙᏱᏗᏢ ᎤᎩᎵᏲᏤᎢ.

source: Let us then go out to him outside the circle of the tents, taking his shame on ourselves.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏕᎾ ᏪᏗᎷᏥ ᎦᎵᏦᏛ ᏙᏱᏗᏢ, ᎢᎦᏠᏯᏍᏗᏍᎨᏍᏗ ᎦᏰᏥᏐᏢᏗᏍᎬᎢ;

source: For here we have no fixed resting-place, but our search is for the one which is to come.
chr: ᎠᏂᏰᏃ ᎥᏝ ᎠᏲᎩ ᏂᎨᏒᎾ ᏱᎩᏚᎭ, ᎢᎩᏲᎭᏍᎩᏂ ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᎵᏴᎢᎶᎯᏍᏗ ᎨᏒᎢ.

source: Let us then make offerings of praise to God at all times through him, that is to say, the fruit of lips giving witness to his name.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎾᏍᎩ ᎢᏳᏩᏂᏌᏛ ᏂᎪᎯᎸ ᎤᏁᎳᏅᎯ ᎦᎸᏉᏙᏗ ᎨᏒ ᎢᏓᎵᏍᎪᎸᏗᏍᎨᏍᏗ, ᎾᏍᎩ ᏕᎩᎭᎦᎸ ᏧᎾᏄᎪᏫᏒᎯ ᎢᏓᎵᏍᎪᎸᏗᏍᎨᏍᏗ, ᎾᏍᎩ ᏕᎤᏙᎥ ᎬᏂᎨᏒ ᏂᏛᏁᎲ ᎡᏓᎵᎡᎵᏤᎲᎢ.

source: But go on doing good and giving to others, because God is well-pleased with such offerings.
chr: ᎣᏍᏛᏍᎩᏂ ᏗᏥᎸᏫᏍᏓᏁᏗᏱ ᎠᎴ ᎢᏣᏓᏁᏗᏱ ᏞᏍᏗ ᎢᏨᎨᏫᏒᎩ; ᎾᏍᎩᏰᏃ ᎢᏳᏍᏗ ᏗᎵᏍᎪᎸᏙᏗ ᎨᏒ ᎣᏏᏳ ᎤᏰᎸᎭ ᎤᏁᎳᏅᎯ.
